import { useState } from 'react';

export const ShopHistory: React.FC = () => {
  const [openText, setOpenText] = useState<boolean>(false);

  const openHandler: () => void = () => {
    openText ? setOpenText(false) : setOpenText(true);
  };

  return (
    <section
      className={
        openText
          ? 'shop-history-block container open-text'
          : 'shop-history-block container'
      }
    >
      <h2 className='shop-history-block__title title'>
        Інтернет мазагин електроніки та цифрової техніки "КІБЕРНЕТИКИ"
      </h2>
      <span className='shop-history-block__description'>
        ТМ "Кібернетики" – торгова марка, заснована в 2009 році, що динамічно
        розвивається в Україні. Компанія займається продажем мобільних
        телефонів, ноутбуків, комп'ютерів та комплектуючих. У магазинах торгової
        мережі «Кібернетики» Ви завжди зможете знайти товар для душі. Всі
        продавці нашої компанії постійно проходять навчальні тренінги від
        світових виробників сучасної електроніки для надання більш якісних та
        професійні консультації. Увага та індивідуальний підхід до кожному
        клієнту не залишать вас байдужими. Наш інтернет магазин гаджетів та
        аксесуарів пропонує якісну цифрову техніку від світових виробників.
        Продукція, представлена ​​у мережі ТМ "Кібернетики", відрізняється
        високою якістю, сучасністю та стильним дизайн. У нас ви знайдете
        величезний вибір сучасних мобільних телефонів, персональних комп'ютерів,
        ноутбуків, фотоапаратів, а також аксесуарів до них. Ми постійно
        розширюємо та оновлюємо асортимент товарів, невпинно відстежуючи всі
        тенденції у світі електроніки та цифрової техніки. У нас ви можете
        придбати онлайн та стати щасливим власником смартфона, про який ви давно
        мріяли, або придбати ноутбук, який стане помічником роботи. Приділяючи
        увагу асортименту, інтернет магазин електроніки не забуває і про якість
        товару. Всі товари представлені в онлайн магазині електроніки
        «Кібернетики» сертифіковані, мають гарантію від виробника, та
        відповідають усім світовим та українським стандартам.
      </span>
      <div
        className={openText ? '' : 'shop-history-block__opacity-block opacity'}
      ></div>
      <div className='shop-history-block__arrow'>
        <span
          className={
            openText
              ? 'shop-history-block__arrow-item replace-arrow'
              : 'shop-history-block__arrow-item'
          }
          onClick={openHandler}
        />
      </div>
    </section>
  );
};
